embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/boards/evkmimxrt685/usb_examples/usb_device_composite_cdc_audio_unified_lite/bm/audio_unified.c
    epCallback.callbackFn = USB_DeviceAudioIsoIN;
    epCallback.callbackParam = handle;

    epInitStruct.zlt = 0U;
    epInitStruct.transferType = USB_ENDPOINT_ISOCHRONOUS;
    epInitStruct.endpointAddress =
        USB_AUDIO_RECORDER_STREAM_ENDPOINT | (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
    if (USB_SPEED_HIGH == g_deviceComposite->speed)
    {
        epInitStruct.maxPacketSize = HS_ISO_IN_ENDP_PACKET_SIZE;
    }
    else
    {
        epInitStruct.maxPacketSize = FS_ISO_IN_ENDP_PACKET_SIZE;
    }

    USB_DeviceInitEndpoint(handle, &epInitStruct, &epCallback);
    error =
        USB_DeviceSendRequest(handle, USB_AUDIO_RECORDER_STREAM_ENDPOINT, s_wavBuff,
                              (USB_SPEED_HIGH == g_deviceComposite->audioUnified.speed) ? (HS_ISO_IN_ENDP_PACKET_SIZE) :
                                                                                          (FS_ISO_IN_ENDP_PACKET_SIZE));
    return error;
}

usb_status_t USB_DeviceAudioSpeakerSetInterface(usb_device_handle handle, uint8_t interface, uint8_t alternateSetting)
{
    usb_device_endpoint_init_struct_t epInitStruct;
    usb_device_endpoint_callback_struct_t epCallback;
    usb_status_t error = kStatus_USB_Error;

#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
#else
    epCallback.callbackFn = USB_DeviceAudioIsoIN;
    epCallback.callbackParam = handle;

    epInitStruct.zlt = 0U;
    epInitStruct.transferType = USB_ENDPOINT_ISOCHRONOUS;
    epInitStruct.endpointAddress =
        USB_AUDIO_SPEAKER_FEEDBACK_ENDPOINT | (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
    if (USB_SPEED_HIGH == g_deviceComposite->speed)
    {
        epInitStruct.maxPacketSize = HS_ISO_FEEDBACK_ENDP_PACKET_SIZE;
    }
    else
    {
        epInitStruct.maxPacketSize = FS_ISO_FEEDBACK_ENDP_PACKET_SIZE;
    }
    USB_DeviceInitEndpoint(handle, &epInitStruct, &epCallback);
    error = USB_DeviceSendRequest(handle, USB_AUDIO_SPEAKER_FEEDBACK_ENDPOINT, audioFeedBackBuffer,
                                  (USB_SPEED_HIGH == g_deviceComposite->audioUnified.speed) ?
                                      HS_ISO_FEEDBACK_ENDP_PACKET_SIZE :
                                      FS_ISO_FEEDBACK_ENDP_PACKET_SIZE);
#endif

    epCallback.callbackFn = USB_DeviceAudioIsoOUT;
    epCallback.callbackParam = handle;

    epInitStruct.zlt = 0U;
    epInitStruct.transferType = USB_ENDPOINT_ISOCHRONOUS;
    epInitStruct.endpointAddress =
        USB_AUDIO_SPEAKER_STREAM_ENDPOINT | (USB_OUT << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
    if (USB_SPEED_HIGH == g_deviceComposite->speed)
    {
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
        epInitStruct.maxPacketSize = (HS_ISO_OUT_ENDP_PACKET_SIZE);
#else
        epInitStruct.maxPacketSize = (HS_ISO_OUT_ENDP_PACKET_SIZE + AUDIO_FORMAT_CHANNELS * AUDIO_FORMAT_SIZE);
#endif
    }
    else
    {
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
        epInitStruct.maxPacketSize = (FS_ISO_OUT_ENDP_PACKET_SIZE);
#else
        epInitStruct.maxPacketSize = (FS_ISO_OUT_ENDP_PACKET_SIZE + AUDIO_FORMAT_CHANNELS * AUDIO_FORMAT_SIZE);
#endif
    }
    USB_DeviceInitEndpoint(handle, &epInitStruct, &epCallback);
    error =
        USB_DeviceRecvRequest(handle, USB_AUDIO_SPEAKER_STREAM_ENDPOINT, &audioPlayDataBuff[0],
                              (USB_SPEED_HIGH == g_deviceComposite->audioUnified.speed) ? HS_ISO_OUT_ENDP_PACKET_SIZE :
                                                                                          FS_ISO_OUT_ENDP_PACKET_SIZE);

    return error;
}

/*!
 * @brief Audio Generator device initialization function.
 *
 * This function initializes the device with the composite device class information.
 *
 * @param deviceComposite The pointer to the composite device structure.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceAudioUnifiedInit(usb_device_composite_struct_t *deviceComposite)
{
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
    SCTIMER_CaptureInit();
#else
    AUDIO_UPDATE_FEEDBACK_DATA(audioFeedBackBuffer, AUDIO_SAMPLING_RATE_TO_10_14);
#endif

    g_deviceComposite = deviceComposite;
    g_deviceComposite->audioUnified.copyProtect = 0x01U;
    g_deviceComposite->audioUnified.curMute = 0x00U;
    g_deviceComposite->audioUnified.curVolume[0] = 0x00U;
    g_deviceComposite->audioUnified.curVolume[1] = 0x1fU;
    g_deviceComposite->audioUnified.minVolume[0] = 0x00U;
    g_deviceComposite->audioUnified.minVolume[1] = 0x00U;
    g_deviceComposite->audioUnified.maxVolume[0] = 0x00U;
    g_deviceComposite->audioUnified.maxVolume[1] = 0X43U;
    g_deviceComposite->audioUnified.resVolume[0] = 0x01U;
    g_deviceComposite->audioUnified.resVolume[1] = 0x00U;
    g_deviceComposite->audioUnified.curBass = 0x00U;
    g_deviceComposite->audioUnified.curBass = 0x00U;
    g_deviceComposite->audioUnified.minBass = 0x80U;
    g_deviceComposite->audioUnified.maxBass = 0x7FU;
    g_deviceComposite->audioUnified.resBass = 0x01U;
    g_deviceComposite->audioUnified.curMid = 0x00U;
    g_deviceComposite->audioUnified.minMid = 0x80U;
    g_deviceComposite->audioUnified.maxMid = 0x7FU;
    g_deviceComposite->audioUnified.resMid = 0x01U;
    g_deviceComposite->audioUnified.curTreble = 0x01U;
    g_deviceComposite->audioUnified.minTreble = 0x80U;
    g_deviceComposite->audioUnified.maxTreble = 0x7FU;
    g_deviceComposite->audioUnified.resTreble = 0x01U;
    g_deviceComposite->audioUnified.curAutomaticGain = 0x01U;
    g_deviceComposite->audioUnified.curDelay[0] = 0x00U;
    g_deviceComposite->audioUnified.curDelay[1] = 0x40U;
    g_deviceComposite->audioUnified.minDelay[0] = 0x00U;
    g_deviceComposite->audioUnified.minDelay[1] = 0x00U;
    g_deviceComposite->audioUnified.maxDelay[0] = 0xFFU;
    g_deviceComposite->audioUnified.maxDelay[1] = 0xFFU;
    g_deviceComposite->audioUnified.resDelay[0] = 0x00U;
    g_deviceComposite->audioUnified.resDelay[1] = 0x01U;
    g_deviceComposite->audioUnified.curLoudness = 0x01U;
    g_deviceComposite->audioUnified.curSamplingFrequency[0] = 0x00U;
    g_deviceComposite->audioUnified.curSamplingFrequency[1] = 0x00U;
    g_deviceComposite->audioUnified.curSamplingFrequency[2] = 0x01U;
    g_deviceComposite->audioUnified.minSamplingFrequency[0] = 0x00U;
    g_deviceComposite->audioUnified.minSamplingFrequency[1] = 0x00U;
    g_deviceComposite->audioUnified.minSamplingFrequency[2] = 0x01U;
    g_deviceComposite->audioUnified.maxSamplingFrequency[0] = 0x00U;
    g_deviceComposite->audioUnified.maxSamplingFrequency[1] = 0x00U;
    g_deviceComposite->audioUnified.maxSamplingFrequency[2] = 0x01U;
    g_deviceComposite->audioUnified.resSamplingFrequency[0] = 0x00U;
    g_deviceComposite->audioUnified.resSamplingFrequency[1] = 0x00U;
    g_deviceComposite->audioUnified.resSamplingFrequency[2] = 0x01U;
    g_deviceComposite->audioUnified.speed = USB_SPEED_FULL;
    g_deviceComposite->audioUnified.tdReadNumberPlay = 0;
    g_deviceComposite->audioUnified.tdWriteNumberPlay = 0;
    g_deviceComposite->audioUnified.audioSendCount = 0;
    g_deviceComposite->audioUnified.lastAudioSendCount = 0;
    g_deviceComposite->audioUnified.usbRecvCount = 0;
    g_deviceComposite->audioUnified.audioSendTimes = 0;
    g_deviceComposite->audioUnified.usbRecvTimes = 0;
    g_deviceComposite->audioUnified.startPlay = 0;
    g_deviceComposite->audioUnified.startPlayHalfFull = 0;
    g_deviceComposite->audioUnified.speakerIntervalCount = 0;
    g_deviceComposite->audioUnified.speakerReservedSpace = 0;
    g_deviceComposite->audioUnified.timesFeedbackCalculate = 0;
    g_deviceComposite->audioUnified.speakerDetachOrNoInput = 0;
    for (uint8_t i = 0; i < USB_AUDIO_COMPOSITE_INTERFACE_COUNT; i++)
    {
        g_deviceComposite->audioUnified.currentInterfaceAlternateSetting[i] = 0;
    }
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
    g_deviceComposite->audioUnified.audioPllTicksPrev = 0;
    g_deviceComposite->audioUnified.audioPllTicksDiff = 0;
    g_deviceComposite->audioUnified.audioPllTicksEma = AUDIO_PLL_USB1_SOF_INTERVAL_COUNT;
    g_deviceComposite->audioUnified.audioPllTickEmaFrac = 0;
    g_deviceComposite->audioUnified.audioPllStep = AUDIO_PLL_FRACTIONAL_CHANGE_STEP;
#endif
    return kStatus_USB_Success;
}

void USB_AudioSpeakerResetTask(void)
{
    if (g_deviceComposite->audioUnified.speakerDetachOrNoInput)
    {
        USB_DeviceAudioSpeakerStatusReset();
    }
}
